ErpTest/src/Reports/уатКарточкаРаботыАккумулятора/уатКарточкаРаботыАккумулятора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>уатКарточкаРаботыАккумулятора</name>
  <comment>Карточка работы аккумулятора</comment>
  <attributes>
    <name>Аккумулятор</name>
    <type>
      <types>CatalogRef.УзлыОбъектовЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостроительОтчета</name>
    <type>
      <types>ReportBuilder</types>
    </type>
  </attributes>
  <attributes>
    <name>СохраненныеНастройки</name>
  </attributes>
  <attributes>
    <name>ТС</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
</mdclass:Report>

ErpTest/src/InformationRegisters/уатАгрегатыТС/уатАгрегатыТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатАгрегатыТС</name>
  <resources>
    <name>ТипАгрегата</name>
    <type>
      <types>CatalogRef.уатТипыАгрегатов</types>
    </type>
  </resources>
  <resources>
    <name>МодельАгрегата</name>
    <type>
      <types>CatalogRef.уатМоделиАгрегатов</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимость</name>
    <comment>Первоначальная стоимость агрегата</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <comment>Валюта первоначальной стоимости</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>НачалоЭксплуатации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГоденДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПараметрВыработки</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПроизводстваШины</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокСлужбыШины</name>
    <comment>Срок службы, мес.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>УзелОбъектаЭксплуатации</name>
    <type>
      <types>CatalogRef.УзлыОбъектовЭксплуатации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьТипАгрегата</name>
    <type>
      <types>CatalogRef.уатТипыАгрегатов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьСерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/уатУстановленныеАгрегаты/уатУстановленныеАгрегаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатУстановленныеАгрегаты</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СостояниеАгрегата</name>
    <type>
      <types>EnumRef.уатСостоянияАгрегатов</types>
    </type>
  </resources>
  <resources>
    <name>МестоУстановки</name>
    <type>
      <types>CatalogRef.уатМестаУстановкиШин</types>
    </type>
  </resources>
  <dimensions>
    <name>УзелОбъектаЭксплуатации</name>
    <type>
      <types>CatalogRef.УзлыОбъектовЭксплуатации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипАгрегата</name>
    <type>
      <types>CatalogRef.уатТипыАгрегатов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/AccumulationRegisters/уатВыработкаТС/уатВыработкаТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатВыработкаТС</name>
  <comment>Выработка транспортных средств (уат)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>CatalogRef.уатВидыПеревозок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Колонна</name>
    <type>
      <types>CatalogRef.уатКолонны</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.уатМаршруты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектСтроительства</name>
    <type>
      <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрВыработки</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТС</name>
    <comment>ТС или оборудование</comment>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтроительнаяРабота</name>
    <type>
      <types>CatalogRef.рар_СтроительныеРаботы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СценарийПланирования</name>
    <type>
      <types>CatalogRef.рар_СценарииПланированияПроектовСтроительства</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/Enums/уатСостоянияАгрегатов/уатСостоянияАгрегатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатСостоянияАгрегатов</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>УстановленоВРаботе</name>
  </enumValues>
  <enumValues>
    <name>УстановленоВЗапас</name>
  </enumValues>
  <enumValues>
    <name>Снято</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Reports/уатКарточкаРаботыАккумулятора/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаНач = НачалоМесяца(ТекущаяДата());
	ДатаКон = ТекущаяДата();
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
			ПользователиКлиентСервер.ТекущийПользователь(), 
			"ОсновнаяОрганизация"
		);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АккумуляторНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("ТипАгрегата, РежимВыбора", "Аккумулятор", Истина);
	ОткрытьФорму("РегистрСведений.уатАгрегатыТС.ФормаСписка", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура АккумуляторОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("РегистрСведенийКлючЗаписи.уатАгрегатыТС") Тогда
		СтандартнаяОбработка = Ложь;
		Аккумулятор = ВыбАгрегатСервер(ВыбранноеЗначение);
		ПриИзмененииАккСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АккумуляторПриИзменении(Элемент)
	
	ПриИзмененииАккСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерТСПриИзменении(Элемент)
	
	уатИнтерфейсВводаТС.НомерТСПриИзменении(НомерТС, ТС, Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерТСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтруктураОтбора = Новый Структура;
	Если ЗначениеЗаполнено(Организация) Тогда
		СтруктураОтбора.Вставить("уатОрганизация", Организация);
	КонецЕсли;
	уатИнтерфейсВводаТС.НомерТСНачалоВыбора(Элемент, ТС, СтруктураОтбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерТСОчистка(Элемент, СтандартнаяОбработка)
	
	уатИнтерфейсВводаТС.НомерТСОчистка(ТС);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерТСОткрытие(Элемент, СтандартнаяОбработка)
	
	уатИнтерфейсВводаТС.НомерТСОткрытие(ТС, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерТСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	уатИнтерфейсВводаТС.НомерТСОбработкаВыбора(НомерТС, ТС, ВыбранноеЗначение, СтандартнаяОбработка, Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерТСАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	уатИнтерфейсВводаТС.НомерТСАвтоПодборТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерТСОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	уатИнтерфейсВводаТС.НомерТСОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, Организация);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	ТекстСообщения = "";
	Если ДатаНач > ДатаКон И ДатаКон <> '00010101' Тогда
		ТекстСообщения = ТекстСообщения + " - Дата начала периода не может быть больше даты конца периода" + Символы.ПС;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Аккумулятор) Тогда
		ТекстСообщения = ТекстСообщения + "- Не указан аккумулятор!" + Символы.ПС;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТС) тогда
		ТекстСообщения = ТекстСообщения + " - Не указано ТС" + Символы.ПС;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекстСообщения) тогда
		ПоказатьПредупреждение(, "Невозможно сформировать отчет: " + Символы.ПС + ТекстСообщения, 10);
		Возврат;
	КонецЕсли;
	
	ТабДок = СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	ДиалогПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогПериода.Период.ДатаНачала = ДатаНач;
	ДиалогПериода.Период.ДатаОкончания = ДатаКон;
	ДиалогПериода.Показать(Новый ОписаниеОповещения("УстановитьПериодЗавершение", ЭтотОбъект, Новый Структура("ДиалогПериода", ДиалогПериода)));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//  ДокументРезультат - табличный документ, формируемый отчетом
//
&НаСервере
Функция СформироватьОтчет() Экспорт
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МИНИМУМ(УстановленоНаТС.Период) КАК ДатаУстановкиАКБНаТС,
	|	УстановленоНаТС.УзелОбъектаЭксплуатации КАК АКБ,
	|	МИНИМУМ(СнятоСТС.Период) КАК ДатаСнятияАКБСТС,
	|	УстановленоНаТС.ТранспортноеСредство.уатМодель КАК МодельТС,
	|	УстановленоНаТС.ТранспортноеСредство.уатГаражныйНомер КАК ИнвНомерТС,
	|	УстановленоНаТС.ТранспортноеСредство.Код КАК ГосНомерТС,
	|	УстановленоНаТС.ТранспортноеСредство.Ссылка КАК ТС,
	|	РАЗНОСТЬДАТ(УстановленоНаТС.Период, ЕСТЬNULL(СнятоСТС.Период, &ДатаКон), МЕСЯЦ) КАК КоличествоМесяцев
	|ПОМЕСТИТЬ АКБДвижения
	|ИЗ
	|	РегистрСведений.уатУстановленныеАгрегаты КАК УстановленоНаТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатУстановленныеАгрегаты.СрезПоследних(&ДатаКон, ТранспортноеСредство = &ТС) КАК СнятоСТС
	|		ПО УстановленоНаТС.УзелОбъектаЭксплуатации = СнятоСТС.УзелОбъектаЭксплуатации
	|			И УстановленоНаТС.ТранспортноеСредство = СнятоСТС.ТранспортноеСредство
	|			И (СнятоСТС.СостояниеАгрегата = ЗНАЧЕНИЕ(Перечисление.уатСостоянияАгрегатов.Снято))
	|ГДЕ
	|	УстановленоНаТС.УзелОбъектаЭксплуатации = &АКБ
	|	И УстановленоНаТС.СостояниеАгрегата = ЗНАЧЕНИЕ(Перечисление.уатСостоянияАгрегатов.УстановленоВРаботе)
	|	И УстановленоНаТС.ТранспортноеСредство = &ТС
	|
	|СГРУППИРОВАТЬ ПО
	|	УстановленоНаТС.УзелОбъектаЭксплуатации,
	|	УстановленоНаТС.ТранспортноеСредство.уатМодель,
	|	УстановленоНаТС.ТранспортноеСредство.уатГаражныйНомер,
	|	УстановленоНаТС.ТранспортноеСредство.Код,
	|	УстановленоНаТС.ТранспортноеСредство.Ссылка,
	|	РАЗНОСТЬДАТ(УстановленоНаТС.Период, ЕСТЬNULL(СнятоСТС.Период, &ДатаКон), МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(уатВыработкаОбороты.КоличествоОборот) КАК Пробег,
	|	уатВыработкаОбороты.ТС КАК ТС
	|ПОМЕСТИТЬ ПробегТСОбщий
	|ИЗ
	|	РегистрНакопления.уатВыработкаТС.Обороты(
	|			,
	|			&ДатаКон,
	|			,
	|			ТС В
	|					(ВЫБРАТЬ
	|						АКБДвижения.ТС
	|					ИЗ
	|						АКБДвижения КАК АКБДвижения)
	|				И Организация = &Организация
	|				И ПараметрВыработки = ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ПробегОбщий)) КАК уатВыработкаОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	уатВыработкаОбороты.ТС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АКБДвижения.ДатаСнятияАКБСТС,
	|	АКБДвижения.ДатаУстановкиАКБНаТС,
	|	АКБДвижения.ГосНомерТС,
	|	АКБДвижения.ИнвНомерТС,
	|	ПробегТСОбщий.Пробег КАК ПробегОбщий,
	|	АКБДвижения.МодельТС,
	|	АКБДвижения.КоличествоМесяцев
	|ИЗ
	|	АКБДвижения КАК АКБДвижения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПробегТСОбщий КАК ПробегТСОбщий
	|		ПО АКБДвижения.ТС = ПробегТСОбщий.ТС");
	
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	
	Шапка = Макет.ПолучитьОбласть("Заголовок");

	НазваниеОрганизации = Организация.НаименованиеПолное;
	Если ПустаяСтрока(НазваниеОрганизации) Тогда
		НазваниеОрганизации = Организация;
	КонецЕсли;
	
	Шапка.Параметры.НазваниеОрганизации	= уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(Организация, ДатаКон),
		"ПолноеНаименование, ЮридическийАдрес, Телефоны");
		
	МодельАкк = РегистрыСведений.уатАгрегатыТС.ПрочитатьРеквизитыАгрегата(Аккумулятор).МодельАгрегата;
	
    Шапка.Параметры.ГаражНомер			= ТС.уатГаражныйНомер;
	Шапка.Параметры.НомерКолонны		= уатОбщегоНазначения.МестонахождениеТС(ТС).Колонна;
	Шапка.Параметры.МаркаАКБ			= МодельАкк;
	Шапка.Параметры.ТС		= ТС;	

	ДокументРезультат.Вывести(Шапка);
	
	Запрос.Параметры.Вставить("ДатаНач", НачалоДня(ДатаНач));
	
	Если ДатаКон <> '00010101' Тогда
		Запрос.Параметры.Вставить("ДатаКон", КонецДня(ДатаКон));
	Иначе
		Запрос.Параметры.Вставить("ДатаКон", ДатаКон);
	КонецЕсли;
	
	Запрос.Параметры.Вставить("АКБ"         , Аккумулятор);
	Запрос.Параметры.Вставить("Организация", Организация);
	Запрос.Параметры.Вставить("ТС"         , ТС);
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗаголовокОтчета = Макет.ПолучитьОбласть("ЗаголовокОтчета");
	
	ДокументРезультат.Вывести(ЗаголовокОтчета);
    Выборка = РезультатЗапроса.Выбрать();
	
	Строка = Макет.ПолучитьОбласть("Строка");
	
	Пока Выборка.Следующий() Цикл
		Строка.Параметры.Заполнить(Выборка);
		Строка.Параметры.ТС = ТС.Код;
		ДокументРезультат.Вывести(Строка);
	КонецЦикла;
	
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ДокументРезультат.Вывести(Подвал);
	
	// Ориентация страницы
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.ПолеСлева = 0;
	ДокументРезультат.ПолеСправа = 0;
	
	// Присвоим имя для сохранения параметров печати табличного документа
	ДокументРезультат.ИмяПараметровПечати = "Карточка работы шины";
	
	Возврат ДокументРезультат;
	
КонецФункции // СформироватьОтчет()

&НаКлиенте
Процедура УстановитьПериодЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ДатаНач = Период.ДатаНачала;
	ДатаКон = Период.ДатаОкончания;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыбАгрегатСервер(КлючЗаписи)
	
	Возврат КлючЗаписи.УзелОбъектаЭксплуатации;
	
КонецФункции

&НаСервере
Процедура ПриИзмененииАккСервер()
	
	НаименованиеАккумулятора = РегистрыСведений.уатАгрегатыТС.ПрочитатьРеквизитыАгрегата(Аккумулятор).Наименование;
	
КонецПроцедуры

#КонецОбласти
